Revit 2027 API
BuiltInFailures.SketchFailures.NotOneLoopPath3d Property
 More than one loop not allowed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotOneLoopPath3d { get; }
Public Shared ReadOnly Property NotOneLoopPath3d As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotOneLoopPath3d {
	FailureDefinitionId^ get ();
}
static member NotOneLoopPath3d : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace